test/performance/benchmarks/real-traffic-test/results/kube-manager/10_seconds-20_interfering/2026-02-23_18-33-23/vegeta_metrics.txt
=== Real Traffic Test Results ===


== Test Configuration ==

Services: 10
RPS: 50
Duration: 1m0s
Min Latency: 0s
Max Latency: 0s
Min Startup Latency: 0s
Max Startup Latency: 0s
Min Payload Size (bytes): 10000
Max Payload Size (bytes): 10000
Critical Test: false
Sources of Interference: 20
Interfering Namespace: interference
Bucket Node: dessertw3


== Test Results ==

= Aggregated Results =

Requests      [total, rate, throughput]         3000, 50.02, 50.01
Duration      [total, attack, wait]             59.986s, 59.98s, 5.92ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.898ms, 249.01ms, 6.576ms, 23.874ms, 2.305s, 4.926s, 7.161s
Bytes In      [total, mean]                     29146154, 9715.38
Bytes Out     [total, mean]                     30000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3000  
Error Set:

= Per-Service Results =

# Service: perftest-0

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.8s, 5.602ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.161ms, 130.623ms, 6.602ms, 19.798ms, 803.853ms, 3.272s, 3.741s
Bytes In      [total, mean]                     2914526, 9715.09
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-1

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.801s, 5.734ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.988ms, 126.332ms, 6.571ms, 14.767ms, 812.349ms, 3.192s, 3.679s
Bytes In      [total, mean]                     2914124, 9713.75
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-2

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.801s, 5.761ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.898ms, 218.503ms, 6.289ms, 19.132ms, 2.038s, 4.429s, 4.841s
Bytes In      [total, mean]                     2914982, 9716.61
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-3

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 5.685ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.24ms, 200.038ms, 6.629ms, 20.692ms, 1.808s, 4.235s, 4.611s
Bytes In      [total, mean]                     2915258, 9717.53
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-4

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.8s, 6.803ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.245ms, 202.334ms, 6.584ms, 24.454ms, 1.885s, 4.226s, 4.666s
Bytes In      [total, mean]                     2915442, 9718.14
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-5

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.8s, 6.339ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.956ms, 215.965ms, 6.564ms, 16.296ms, 1.986s, 4.435s, 4.815s
Bytes In      [total, mean]                     2914882, 9716.27
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-6

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.799s, 6.702ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.09ms, 306.913ms, 6.614ms, 111.63ms, 3.003s, 5.419s, 5.868s
Bytes In      [total, mean]                     2911871, 9706.24
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-7

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 6.37ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.288ms, 298.838ms, 6.674ms, 75.752ms, 2.918s, 5.32s, 5.705s
Bytes In      [total, mean]                     2915282, 9717.61
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-8

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.8s, 5.486ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.305ms, 319.471ms, 6.531ms, 183.594ms, 3.121s, 5.552s, 5.957s
Bytes In      [total, mean]                     2914563, 9715.21
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-9

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.801s, 5.92ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.167ms, 471.082ms, 6.527ms, 1.539s, 4.468s, 6.739s, 7.161s
Bytes In      [total, mean]                     2915224, 9717.41
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set: